aa-Combined-JMeter-and-Selenium.yaml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: aa-Selenium
  blazegrid: true
  
  capabilities: 
    browserName: chrome
  hold-for: 20m

- executor: jmeter
  scenario: aa-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  aa-Selenium:
    browser: Chrome  # available browsers are: ["Firefox", "Chrome", "Ie", "Opera"]
    generate-flow-markers: true 
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - go(chrome://newtab/)
      - go(https://203.109.87.220:1148/Global_UI/MyESOPs/Login.aspx)
      - clickByID(txtUserId)
      - clickByID(txtUserId)
      - typeByID(txtUserId): "612561"
      - typeByID(txtPassword): "esop1234"
      - typeByID(txtCompanyId): "infosys2"
      - clickByID(login_btn)
      - clickByID(UserLogo)
      - clickByLinkText(Logout)

  aa-Http:
    headers:
      User-Agent: 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/75.0.3770.142 Safari/537.36'
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: 'https://203.109.87.220:1148/Global_UI/MyESOPs/Login.aspx'
            method: GET
            label: 'https://203.109.87.220:1148/Global_UI/MyESOPs/Login.aspx'
            think-time: 0ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3'
          - url: 'https://203.109.87.220:1148/Global_UI/MyESOPWebAPI/GetUserType'
            method: POST
            label: 'https://203.109.87.220:1148/Global_UI/MyESOPWebAPI/GetUserType'
            headers:
              Accept: '*/*'
              Origin: 'https://203.109.87.220:1148'
              X-Requested-With: XMLHttpRequest
              Content-Type: application/x-www-form-urlencoded; charset=UTF-8
            body:
              CompanyId: 2GIUf5jczKTayJL7W9G+zA==
              Password: LDsMB6rGXwYWCKdKEybGUw==
              UserId: nDGH7oTAxsFqCM/IpPpyog==
          - url: 'https://203.109.87.220:1148/Global_UI/MyESOPWebAPI/token'
            method: POST
            label: 'https://203.109.87.220:1148/Global_UI/MyESOPWebAPI/token'
            headers:
              Accept: application/json
              Origin: 'https://203.109.87.220:1148'
              X-Requested-With: XMLHttpRequest
              Content-Type: application/x-www-form-urlencoded
            body:
              ClientId: 2GIUf5jczKTayJL7W9G+zA==
              Password: LDsMB6rGXwYWCKdKEybGUw==
              UserName: nDGH7oTAxsFqCM/IpPpyog==
              grant_type: password
          - url: 'https://203.109.87.220:1148/Global_UI/MyESOPWebAPI/Post_UserLoginHistory'
            method: GET
            label: 'https://203.109.87.220:1148/Global_UI/MyESOPWebAPI/Post_UserLoginHistory'
            headers:
              Accept: application/json
              X-Requested-With: XMLHttpRequest
              Authorization: bearer FFQatnGTZ6daE8pOw93P2Y27s5mDf9LAe0UHyzFTu54adMqW1r3nIsP5GZ8xUVJjDy4j5hyxVBpG6rzaamMJkvKvP4mKOiOv-UgUhH6o0he6LMxsbXKjhSPPuRXtJJUTOy9hGw5-iuWjyVwvAvgkWy1FI5JfL7tPrgGBt_4EFfnTl_wFOTihNJxSkIn5vj8g16irlcfmJsEiS0en9Z_aKiNhyJ0to0O-xMNpJJGVjWHjLfTzdTZI1TEihvDACdd7eiwVBKPHpbz5_BCazFUEYP9Zu6ME9fj98mAjGIqR9XWAOAXzG2qGbSuxsCeOjcFQ1F_uPYyzivWG-rZHI9BuokdYrZHVAPPR-Bo2NRzrcHfgal4e3frBY4_dTqeeuG2BKHaXiUKyJ8rm5TrLEcBGaohfxfXfU9P025vdvZEu5Ps3h0xYHJgqnyzxYOAlmTSCEU1KLphgRWzPYxZQSYqdaq-fhvH2X72VEcvMUXJd08eIJs61TtOFg8tUeNuvb7qqI0SE7tbSaz1OemZ93OnyYrBykrsuj0T4KWAyp9p2MHtfwvpCH-csxT-nC2Szwo38b194mW4yWRsAvCF3haq1GoyqGyPt2MJEdlvPOgueX9cUdGimb-f9zTRPtGsXQ-YGTr0LYodsEMUbc3p2PjBgSIZ2ycUBgmX2nM_DCJGnhMZzOtQKDox4RiSdwrNZMTOIjp4CKEimSPb626TSJgpGCg
              Content-Type: application/json
            body:
              companyId: 2GIUf5jczKTayJL7W9G+zA==
              UserID: nDGH7oTAxsFqCM/IpPpyog==
          - url: 'https://203.109.87.220:1148/Global_UI/MyESOPs/Dashboard/EmployeeDashboard.aspx'
            method: GET
            label: 'https://203.109.87.220:1148/Global_UI/MyESOPs/Dashboard/EmployeeDashboard.aspx'
            think-time: 83ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3'
          - url: 'https://203.109.87.220:1148/Global_UI/MyESOPWebAPI/GetXmlDataPath'
            method: GET
            label: 'https://203.109.87.220:1148/Global_UI/MyESOPWebAPI/GetXmlDataPath'
            headers:
              Accept: application/json
              X-Requested-With: XMLHttpRequest
              Authorization: bearer FFQatnGTZ6daE8pOw93P2Y27s5mDf9LAe0UHyzFTu54adMqW1r3nIsP5GZ8xUVJjDy4j5hyxVBpG6rzaamMJkvKvP4mKOiOv-UgUhH6o0he6LMxsbXKjhSPPuRXtJJUTOy9hGw5-iuWjyVwvAvgkWy1FI5JfL7tPrgGBt_4EFfnTl_wFOTihNJxSkIn5vj8g16irlcfmJsEiS0en9Z_aKiNhyJ0to0O-xMNpJJGVjWHjLfTzdTZI1TEihvDACdd7eiwVBKPHpbz5_BCazFUEYP9Zu6ME9fj98mAjGIqR9XWAOAXzG2qGbSuxsCeOjcFQ1F_uPYyzivWG-rZHI9BuokdYrZHVAPPR-Bo2NRzrcHfgal4e3frBY4_dTqeeuG2BKHaXiUKyJ8rm5TrLEcBGaohfxfXfU9P025vdvZEu5Ps3h0xYHJgqnyzxYOAlmTSCEU1KLphgRWzPYxZQSYqdaq-fhvH2X72VEcvMUXJd08eIJs61TtOFg8tUeNuvb7qqI0SE7tbSaz1OemZ93OnyYrBykrsuj0T4KWAyp9p2MHtfwvpCH-csxT-nC2Szwo38b194mW4yWRsAvCF3haq1GoyqGyPt2MJEdlvPOgueX9cUdGimb-f9zTRPtGsXQ-YGTr0LYodsEMUbc3p2PjBgSIZ2ycUBgmX2nM_DCJGnhMZzOtQKDox4RiSdwrNZMTOIjp4CKEimSPb626TSJgpGCg
              Content-Type: application/json
            body:
              companyId: 2GIUf5jczKTayJL7W9G+zA==
              userId: nDGH7oTAxsFqCM/IpPpyog==
          - url: 'https://203.109.87.220:1148/Global_UI/MyESOPWebAPI/GET_Dashboard'
            method: GET
            label: 'https://203.109.87.220:1148/Global_UI/MyESOPWebAPI/GET_Dashboard'
            headers:
              Accept: application/json
              X-Requested-With: XMLHttpRequest
              Authorization: bearer FFQatnGTZ6daE8pOw93P2Y27s5mDf9LAe0UHyzFTu54adMqW1r3nIsP5GZ8xUVJjDy4j5hyxVBpG6rzaamMJkvKvP4mKOiOv-UgUhH6o0he6LMxsbXKjhSPPuRXtJJUTOy9hGw5-iuWjyVwvAvgkWy1FI5JfL7tPrgGBt_4EFfnTl_wFOTihNJxSkIn5vj8g16irlcfmJsEiS0en9Z_aKiNhyJ0to0O-xMNpJJGVjWHjLfTzdTZI1TEihvDACdd7eiwVBKPHpbz5_BCazFUEYP9Zu6ME9fj98mAjGIqR9XWAOAXzG2qGbSuxsCeOjcFQ1F_uPYyzivWG-rZHI9BuokdYrZHVAPPR-Bo2NRzrcHfgal4e3frBY4_dTqeeuG2BKHaXiUKyJ8rm5TrLEcBGaohfxfXfU9P025vdvZEu5Ps3h0xYHJgqnyzxYOAlmTSCEU1KLphgRWzPYxZQSYqdaq-fhvH2X72VEcvMUXJd08eIJs61TtOFg8tUeNuvb7qqI0SE7tbSaz1OemZ93OnyYrBykrsuj0T4KWAyp9p2MHtfwvpCH-csxT-nC2Szwo38b194mW4yWRsAvCF3haq1GoyqGyPt2MJEdlvPOgueX9cUdGimb-f9zTRPtGsXQ-YGTr0LYodsEMUbc3p2PjBgSIZ2ycUBgmX2nM_DCJGnhMZzOtQKDox4RiSdwrNZMTOIjp4CKEimSPb626TSJgpGCg
              Content-Type: application/json
            body:
              EmployeeId: nDGH7oTAxsFqCM/IpPpyog==
              CompanyId: 2GIUf5jczKTayJL7W9G+zA==
              Dashboard_Type: '1'
          - url: 'https://203.109.87.220:1148/Global_UI/MyESOPWebAPI/GetDoghnutChart'
            method: GET
            label: 'https://203.109.87.220:1148/Global_UI/MyESOPWebAPI/GetDoghnutChart'
            headers:
              Accept: application/json
              X-Requested-With: XMLHttpRequest
              Authorization: bearer FFQatnGTZ6daE8pOw93P2Y27s5mDf9LAe0UHyzFTu54adMqW1r3nIsP5GZ8xUVJjDy4j5hyxVBpG6rzaamMJkvKvP4mKOiOv-UgUhH6o0he6LMxsbXKjhSPPuRXtJJUTOy9hGw5-iuWjyVwvAvgkWy1FI5JfL7tPrgGBt_4EFfnTl_wFOTihNJxSkIn5vj8g16irlcfmJsEiS0en9Z_aKiNhyJ0to0O-xMNpJJGVjWHjLfTzdTZI1TEihvDACdd7eiwVBKPHpbz5_BCazFUEYP9Zu6ME9fj98mAjGIqR9XWAOAXzG2qGbSuxsCeOjcFQ1F_uPYyzivWG-rZHI9BuokdYrZHVAPPR-Bo2NRzrcHfgal4e3frBY4_dTqeeuG2BKHaXiUKyJ8rm5TrLEcBGaohfxfXfU9P025vdvZEu5Ps3h0xYHJgqnyzxYOAlmTSCEU1KLphgRWzPYxZQSYqdaq-fhvH2X72VEcvMUXJd08eIJs61TtOFg8tUeNuvb7qqI0SE7tbSaz1OemZ93OnyYrBykrsuj0T4KWAyp9p2MHtfwvpCH-csxT-nC2Szwo38b194mW4yWRsAvCF3haq1GoyqGyPt2MJEdlvPOgueX9cUdGimb-f9zTRPtGsXQ-YGTr0LYodsEMUbc3p2PjBgSIZ2ycUBgmX2nM_DCJGnhMZzOtQKDox4RiSdwrNZMTOIjp4CKEimSPb626TSJgpGCg
              Content-Type: application/json
            body:
              EmployeeId: nDGH7oTAxsFqCM/IpPpyog==
              CompanyId: 2GIUf5jczKTayJL7W9G+zA==
          - url: 'https://203.109.87.220:1148/Global_UI/MyESOPWebAPI/MySummaryReportData'
            method: GET
            label: 'https://203.109.87.220:1148/Global_UI/MyESOPWebAPI/MySummaryReportData'
            headers:
              Accept: application/json
              X-Requested-With: XMLHttpRequest
              Authorization: bearer FFQatnGTZ6daE8pOw93P2Y27s5mDf9LAe0UHyzFTu54adMqW1r3nIsP5GZ8xUVJjDy4j5hyxVBpG6rzaamMJkvKvP4mKOiOv-UgUhH6o0he6LMxsbXKjhSPPuRXtJJUTOy9hGw5-iuWjyVwvAvgkWy1FI5JfL7tPrgGBt_4EFfnTl_wFOTihNJxSkIn5vj8g16irlcfmJsEiS0en9Z_aKiNhyJ0to0O-xMNpJJGVjWHjLfTzdTZI1TEihvDACdd7eiwVBKPHpbz5_BCazFUEYP9Zu6ME9fj98mAjGIqR9XWAOAXzG2qGbSuxsCeOjcFQ1F_uPYyzivWG-rZHI9BuokdYrZHVAPPR-Bo2NRzrcHfgal4e3frBY4_dTqeeuG2BKHaXiUKyJ8rm5TrLEcBGaohfxfXfU9P025vdvZEu5Ps3h0xYHJgqnyzxYOAlmTSCEU1KLphgRWzPYxZQSYqdaq-fhvH2X72VEcvMUXJd08eIJs61TtOFg8tUeNuvb7qqI0SE7tbSaz1OemZ93OnyYrBykrsuj0T4KWAyp9p2MHtfwvpCH-csxT-nC2Szwo38b194mW4yWRsAvCF3haq1GoyqGyPt2MJEdlvPOgueX9cUdGimb-f9zTRPtGsXQ-YGTr0LYodsEMUbc3p2PjBgSIZ2ycUBgmX2nM_DCJGnhMZzOtQKDox4RiSdwrNZMTOIjp4CKEimSPb626TSJgpGCg
              Content-Type: application/json
            body:
              EmployeeId: nDGH7oTAxsFqCM/IpPpyog==
              CompanyId: 2GIUf5jczKTayJL7W9G+zA==
              ControlMasterID: '15'
          - url: 'https://203.109.87.220:1148/Global_UI/MyESOPWebAPI/GetExerciseTransactionStatusReport'
            method: GET
            label: 'https://203.109.87.220:1148/Global_UI/MyESOPWebAPI/GetExerciseTransactionStatusReport'
            headers:
              Accept: application/json
              X-Requested-With: XMLHttpRequest
              Authorization: bearer FFQatnGTZ6daE8pOw93P2Y27s5mDf9LAe0UHyzFTu54adMqW1r3nIsP5GZ8xUVJjDy4j5hyxVBpG6rzaamMJkvKvP4mKOiOv-UgUhH6o0he6LMxsbXKjhSPPuRXtJJUTOy9hGw5-iuWjyVwvAvgkWy1FI5JfL7tPrgGBt_4EFfnTl_wFOTihNJxSkIn5vj8g16irlcfmJsEiS0en9Z_aKiNhyJ0to0O-xMNpJJGVjWHjLfTzdTZI1TEihvDACdd7eiwVBKPHpbz5_BCazFUEYP9Zu6ME9fj98mAjGIqR9XWAOAXzG2qGbSuxsCeOjcFQ1F_uPYyzivWG-rZHI9BuokdYrZHVAPPR-Bo2NRzrcHfgal4e3frBY4_dTqeeuG2BKHaXiUKyJ8rm5TrLEcBGaohfxfXfU9P025vdvZEu5Ps3h0xYHJgqnyzxYOAlmTSCEU1KLphgRWzPYxZQSYqdaq-fhvH2X72VEcvMUXJd08eIJs61TtOFg8tUeNuvb7qqI0SE7tbSaz1OemZ93OnyYrBykrsuj0T4KWAyp9p2MHtfwvpCH-csxT-nC2Szwo38b194mW4yWRsAvCF3haq1GoyqGyPt2MJEdlvPOgueX9cUdGimb-f9zTRPtGsXQ-YGTr0LYodsEMUbc3p2PjBgSIZ2ycUBgmX2nM_DCJGnhMZzOtQKDox4RiSdwrNZMTOIjp4CKEimSPb626TSJgpGCg
              Content-Type: application/json
            body:
              EmployeeId: nDGH7oTAxsFqCM/IpPpyog==
              CompanyId: 2GIUf5jczKTayJL7W9G+zA==
          - url: 'https://203.109.87.220:1148/Global_UI/MyESOPWebAPI/OGAStatus'
            method: GET
            label: 'https://203.109.87.220:1148/Global_UI/MyESOPWebAPI/OGAStatus'
            headers:
              Accept: application/json
              X-Requested-With: XMLHttpRequest
              Authorization: bearer FFQatnGTZ6daE8pOw93P2Y27s5mDf9LAe0UHyzFTu54adMqW1r3nIsP5GZ8xUVJjDy4j5hyxVBpG6rzaamMJkvKvP4mKOiOv-UgUhH6o0he6LMxsbXKjhSPPuRXtJJUTOy9hGw5-iuWjyVwvAvgkWy1FI5JfL7tPrgGBt_4EFfnTl_wFOTihNJxSkIn5vj8g16irlcfmJsEiS0en9Z_aKiNhyJ0to0O-xMNpJJGVjWHjLfTzdTZI1TEihvDACdd7eiwVBKPHpbz5_BCazFUEYP9Zu6ME9fj98mAjGIqR9XWAOAXzG2qGbSuxsCeOjcFQ1F_uPYyzivWG-rZHI9BuokdYrZHVAPPR-Bo2NRzrcHfgal4e3frBY4_dTqeeuG2BKHaXiUKyJ8rm5TrLEcBGaohfxfXfU9P025vdvZEu5Ps3h0xYHJgqnyzxYOAlmTSCEU1KLphgRWzPYxZQSYqdaq-fhvH2X72VEcvMUXJd08eIJs61TtOFg8tUeNuvb7qqI0SE7tbSaz1OemZ93OnyYrBykrsuj0T4KWAyp9p2MHtfwvpCH-csxT-nC2Szwo38b194mW4yWRsAvCF3haq1GoyqGyPt2MJEdlvPOgueX9cUdGimb-f9zTRPtGsXQ-YGTr0LYodsEMUbc3p2PjBgSIZ2ycUBgmX2nM_DCJGnhMZzOtQKDox4RiSdwrNZMTOIjp4CKEimSPb626TSJgpGCg
              Content-Type: application/json
            body:
              EmployeeId: nDGH7oTAxsFqCM/IpPpyog==
              CompanyId: 2GIUf5jczKTayJL7W9G+zA==
          - url: 'https://203.109.87.220:1148/Global_UI/MyESOPWebAPI/MySummaryReportData'
            method: GET
            label: 'https://203.109.87.220:1148/Global_UI/MyESOPWebAPI/MySummaryReportData'
            headers:
              Accept: application/json
              X-Requested-With: XMLHttpRequest
              Authorization: bearer FFQatnGTZ6daE8pOw93P2Y27s5mDf9LAe0UHyzFTu54adMqW1r3nIsP5GZ8xUVJjDy4j5hyxVBpG6rzaamMJkvKvP4mKOiOv-UgUhH6o0he6LMxsbXKjhSPPuRXtJJUTOy9hGw5-iuWjyVwvAvgkWy1FI5JfL7tPrgGBt_4EFfnTl_wFOTihNJxSkIn5vj8g16irlcfmJsEiS0en9Z_aKiNhyJ0to0O-xMNpJJGVjWHjLfTzdTZI1TEihvDACdd7eiwVBKPHpbz5_BCazFUEYP9Zu6ME9fj98mAjGIqR9XWAOAXzG2qGbSuxsCeOjcFQ1F_uPYyzivWG-rZHI9BuokdYrZHVAPPR-Bo2NRzrcHfgal4e3frBY4_dTqeeuG2BKHaXiUKyJ8rm5TrLEcBGaohfxfXfU9P025vdvZEu5Ps3h0xYHJgqnyzxYOAlmTSCEU1KLphgRWzPYxZQSYqdaq-fhvH2X72VEcvMUXJd08eIJs61TtOFg8tUeNuvb7qqI0SE7tbSaz1OemZ93OnyYrBykrsuj0T4KWAyp9p2MHtfwvpCH-csxT-nC2Szwo38b194mW4yWRsAvCF3haq1GoyqGyPt2MJEdlvPOgueX9cUdGimb-f9zTRPtGsXQ-YGTr0LYodsEMUbc3p2PjBgSIZ2ycUBgmX2nM_DCJGnhMZzOtQKDox4RiSdwrNZMTOIjp4CKEimSPb626TSJgpGCg
              Content-Type: application/json
            body:
              EmployeeId: nDGH7oTAxsFqCM/IpPpyog==
              CompanyId: 2GIUf5jczKTayJL7W9G+zA==
              ControlMasterID: '23'
          - url: 'https://203.109.87.220:1148/Global_UI/MyESOPWebAPI/ForcePasswordChange'
            method: GET
            label: 'https://203.109.87.220:1148/Global_UI/MyESOPWebAPI/ForcePasswordChange'
            headers:
              Accept: application/json
              X-Requested-With: XMLHttpRequest
              Authorization: bearer FFQatnGTZ6daE8pOw93P2Y27s5mDf9LAe0UHyzFTu54adMqW1r3nIsP5GZ8xUVJjDy4j5hyxVBpG6rzaamMJkvKvP4mKOiOv-UgUhH6o0he6LMxsbXKjhSPPuRXtJJUTOy9hGw5-iuWjyVwvAvgkWy1FI5JfL7tPrgGBt_4EFfnTl_wFOTihNJxSkIn5vj8g16irlcfmJsEiS0en9Z_aKiNhyJ0to0O-xMNpJJGVjWHjLfTzdTZI1TEihvDACdd7eiwVBKPHpbz5_BCazFUEYP9Zu6ME9fj98mAjGIqR9XWAOAXzG2qGbSuxsCeOjcFQ1F_uPYyzivWG-rZHI9BuokdYrZHVAPPR-Bo2NRzrcHfgal4e3frBY4_dTqeeuG2BKHaXiUKyJ8rm5TrLEcBGaohfxfXfU9P025vdvZEu5Ps3h0xYHJgqnyzxYOAlmTSCEU1KLphgRWzPYxZQSYqdaq-fhvH2X72VEcvMUXJd08eIJs61TtOFg8tUeNuvb7qqI0SE7tbSaz1OemZ93OnyYrBykrsuj0T4KWAyp9p2MHtfwvpCH-csxT-nC2Szwo38b194mW4yWRsAvCF3haq1GoyqGyPt2MJEdlvPOgueX9cUdGimb-f9zTRPtGsXQ-YGTr0LYodsEMUbc3p2PjBgSIZ2ycUBgmX2nM_DCJGnhMZzOtQKDox4RiSdwrNZMTOIjp4CKEimSPb626TSJgpGCg
              Content-Type: application/json
            body:
              companyid: 2GIUf5jczKTayJL7W9G+zA==
              userId: nDGH7oTAxsFqCM/IpPpyog==
          - url: 'https://203.109.87.220:1148/Global_UI/MyESOPWebAPI/GetMenuSubMenu'
            method: GET
            label: 'https://203.109.87.220:1148/Global_UI/MyESOPWebAPI/GetMenuSubMenu'
            headers:
              Accept: application/json
              X-Requested-With: XMLHttpRequest
              Authorization: bearer FFQatnGTZ6daE8pOw93P2Y27s5mDf9LAe0UHyzFTu54adMqW1r3nIsP5GZ8xUVJjDy4j5hyxVBpG6rzaamMJkvKvP4mKOiOv-UgUhH6o0he6LMxsbXKjhSPPuRXtJJUTOy9hGw5-iuWjyVwvAvgkWy1FI5JfL7tPrgGBt_4EFfnTl_wFOTihNJxSkIn5vj8g16irlcfmJsEiS0en9Z_aKiNhyJ0to0O-xMNpJJGVjWHjLfTzdTZI1TEihvDACdd7eiwVBKPHpbz5_BCazFUEYP9Zu6ME9fj98mAjGIqR9XWAOAXzG2qGbSuxsCeOjcFQ1F_uPYyzivWG-rZHI9BuokdYrZHVAPPR-Bo2NRzrcHfgal4e3frBY4_dTqeeuG2BKHaXiUKyJ8rm5TrLEcBGaohfxfXfU9P025vdvZEu5Ps3h0xYHJgqnyzxYOAlmTSCEU1KLphgRWzPYxZQSYqdaq-fhvH2X72VEcvMUXJd08eIJs61TtOFg8tUeNuvb7qqI0SE7tbSaz1OemZ93OnyYrBykrsuj0T4KWAyp9p2MHtfwvpCH-csxT-nC2Szwo38b194mW4yWRsAvCF3haq1GoyqGyPt2MJEdlvPOgueX9cUdGimb-f9zTRPtGsXQ-YGTr0LYodsEMUbc3p2PjBgSIZ2ycUBgmX2nM_DCJGnhMZzOtQKDox4RiSdwrNZMTOIjp4CKEimSPb626TSJgpGCg
              Content-Type: application/json
            body:
              userTypeId: '3'
              companyId: 2GIUf5jczKTayJL7W9G+zA==
              userID: nDGH7oTAxsFqCM/IpPpyog==
          - url: 'https://203.109.87.220:1148/Global_UI/MyESOPWebAPI/ClosingMarketPrice'
            method: GET
            label: 'https://203.109.87.220:1148/Global_UI/MyESOPWebAPI/ClosingMarketPrice'
            headers:
              Accept: application/json
              X-Requested-With: XMLHttpRequest
              Authorization: bearer FFQatnGTZ6daE8pOw93P2Y27s5mDf9LAe0UHyzFTu54adMqW1r3nIsP5GZ8xUVJjDy4j5hyxVBpG6rzaamMJkvKvP4mKOiOv-UgUhH6o0he6LMxsbXKjhSPPuRXtJJUTOy9hGw5-iuWjyVwvAvgkWy1FI5JfL7tPrgGBt_4EFfnTl_wFOTihNJxSkIn5vj8g16irlcfmJsEiS0en9Z_aKiNhyJ0to0O-xMNpJJGVjWHjLfTzdTZI1TEihvDACdd7eiwVBKPHpbz5_BCazFUEYP9Zu6ME9fj98mAjGIqR9XWAOAXzG2qGbSuxsCeOjcFQ1F_uPYyzivWG-rZHI9BuokdYrZHVAPPR-Bo2NRzrcHfgal4e3frBY4_dTqeeuG2BKHaXiUKyJ8rm5TrLEcBGaohfxfXfU9P025vdvZEu5Ps3h0xYHJgqnyzxYOAlmTSCEU1KLphgRWzPYxZQSYqdaq-fhvH2X72VEcvMUXJd08eIJs61TtOFg8tUeNuvb7qqI0SE7tbSaz1OemZ93OnyYrBykrsuj0T4KWAyp9p2MHtfwvpCH-csxT-nC2Szwo38b194mW4yWRsAvCF3haq1GoyqGyPt2MJEdlvPOgueX9cUdGimb-f9zTRPtGsXQ-YGTr0LYodsEMUbc3p2PjBgSIZ2ycUBgmX2nM_DCJGnhMZzOtQKDox4RiSdwrNZMTOIjp4CKEimSPb626TSJgpGCg
              Content-Type: application/json
            body:
              CompanyId: 2GIUf5jczKTayJL7W9G+zA==
              UserId: nDGH7oTAxsFqCM/IpPpyog==
          - url: 'https://203.109.87.220:1148/Global_UI/MyESOPWebAPI/UserLoginHistory'
            method: GET
            label: 'https://203.109.87.220:1148/Global_UI/MyESOPWebAPI/UserLoginHistory'
            headers:
              Accept: application/json
              X-Requested-With: XMLHttpRequest
              Authorization: bearer FFQatnGTZ6daE8pOw93P2Y27s5mDf9LAe0UHyzFTu54adMqW1r3nIsP5GZ8xUVJjDy4j5hyxVBpG6rzaamMJkvKvP4mKOiOv-UgUhH6o0he6LMxsbXKjhSPPuRXtJJUTOy9hGw5-iuWjyVwvAvgkWy1FI5JfL7tPrgGBt_4EFfnTl_wFOTihNJxSkIn5vj8g16irlcfmJsEiS0en9Z_aKiNhyJ0to0O-xMNpJJGVjWHjLfTzdTZI1TEihvDACdd7eiwVBKPHpbz5_BCazFUEYP9Zu6ME9fj98mAjGIqR9XWAOAXzG2qGbSuxsCeOjcFQ1F_uPYyzivWG-rZHI9BuokdYrZHVAPPR-Bo2NRzrcHfgal4e3frBY4_dTqeeuG2BKHaXiUKyJ8rm5TrLEcBGaohfxfXfU9P025vdvZEu5Ps3h0xYHJgqnyzxYOAlmTSCEU1KLphgRWzPYxZQSYqdaq-fhvH2X72VEcvMUXJd08eIJs61TtOFg8tUeNuvb7qqI0SE7tbSaz1OemZ93OnyYrBykrsuj0T4KWAyp9p2MHtfwvpCH-csxT-nC2Szwo38b194mW4yWRsAvCF3haq1GoyqGyPt2MJEdlvPOgueX9cUdGimb-f9zTRPtGsXQ-YGTr0LYodsEMUbc3p2PjBgSIZ2ycUBgmX2nM_DCJGnhMZzOtQKDox4RiSdwrNZMTOIjp4CKEimSPb626TSJgpGCg
              Content-Type: application/json
            body:
              companyId: 2GIUf5jczKTayJL7W9G+zA==
              userId: nDGH7oTAxsFqCM/IpPpyog==
          - url: 'https://203.109.87.220:1148/Global_UI/MyESOPs/Login.aspx'
            method: GET
            label: 'https://203.109.87.220:1148/Global_UI/MyESOPs/Login.aspx'
            think-time: 83ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3'